## Introduction

The objectives of this notebook are:  
1. Understanding data manipulation in Pandas.
2. Learning the internal working of matplotlib library.
3. Understanding Standard Deviation, Variance through examples.
4. Visualizing all statistical features like Z-scores etc.
5. Feature transformation:
       a. Standardization
       b. Normalization
       c. Log Transformations

In [1]:
import pandas as pd
import palmerpenguins as pp
##to see the package details
#!pip show palmerpenguins

In [14]:
#checking what all present in palmerpenguins library.
dir(palmerpenguins)

In [2]:
#load the dataset
penguin_data = pp.load_penguins()

In [3]:
penguin_data.head(3)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007

In [4]:
penguin_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
 7   year               344 non-null    int64
dtypes: float64(4), int64(1), object(3)
memory usage: 21.6+ KB

In [9]:
#check for duplicate rows--None
penguin_data.duplicated().sum()

np.int64(0)

In [10]:
#check number of missing values in each column
penguin_data.isnull().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
year                  0
dtype: int64

In [11]:
#see all rows where at least 1 missing value present.
penguin_data[penguin_data.isnull().any(axis=1)]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN,2007
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN,2007
10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN,2007
11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN,2007
47,Adelie,Dream,37.5,18.9,179.0,2975.0,NaN,2007
178,Gentoo,Biscoe,44.5,14.3,216.0,4100.0,NaN,2007
218,Gentoo,Biscoe,46.2,14.4,214.0,4650.0,NaN,2008
256,Gentoo,Biscoe,47.3,13.8,216.0,4725.0,NaN,2009
268,Gentoo,Biscoe,44.5,15.7,217.0,4875.0,NaN,2009
271,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2009

In [13]:
#drop all NA values
penguin_data.dropna(inplace = True)

In [20]:
#check for all unique values in 'species', 'island', 'sex' and 'year'
categorical_columns = penguin_data.select_dtypes(exclude = "float").columns.tolist()
categorical_columns

['species', 'island', 'sex', 'year']

In [21]:
#View all unique values in these columns
for i in categorical_columns:
    unique_categories = penguin_data[i].unique()
    print(i, ": ", unique_categories)

species :  ['Adelie' 'Gentoo' 'Chinstrap']
island :  ['Torgersen' 'Biscoe' 'Dream']
sex :  ['male' 'female']
year :  [2007 2008 2009]

In [23]:
#Statistical summary of numeric columns
penguin_data.drop(columns = ['year']).describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      333.000000     333.000000         333.000000   333.000000
mean        43.992793      17.164865         200.966967  4207.057057
std          5.468668       1.969235          14.015765   805.215802
min         32.100000      13.100000         172.000000  2700.000000
25%         39.500000      15.600000         190.000000  3550.000000
50%         44.500000      17.300000         197.000000  4050.000000
75%         48.600000      18.700000         213.000000  4775.000000
max         59.600000      21.500000         231.000000  6300.000000